// 工资
var salaryItems=[
     "<1000",
     "1000-2000",
     "2000-4000",
     "4000-6000",
     "6000-8000",
     "8000-10000",
     "10000-15000",
     "15000-25000",
     "25000-35000",
     "35000-50000",
     "50000-75000",
     "75000-100000",
     ">100000"
];
// 期望学历
var scolarship =[
          "本科",
          "硕士",
          "博士",
          "MBA",
          "EMBA",
          "大专",
          "中专",
          "中技",
          "高中",
          "初中",
          "其他"]

// 民族数据
var nations = [
     "汉族",
"壮族",
"满族",
"回族",
"苗族",
"维吾尔族",
"土家族",
"彝族",
"蒙古族",
"藏族",
"布依族",
"侗族",
"瑶族",
"朝鲜族",
"白族",
"哈尼族",
"哈萨克族",
"黎族",
"傣族",
"畲族",
"傈僳族",
"仡佬族",
"东乡族",
"高山族",
"拉祜族",
"水族",
"佤族",
"纳西族",
"羌族",
"土族",
"仫佬族",
"锡伯族",
"柯尔克孜族",
"达斡尔族",
"景颇族",
"毛南族",
"撒拉族",
"布朗族",
"塔吉克族",
"阿昌族",
"普米族",
"鄂温克族",
"怒族",
"京族",
"基诺族",
"德昂族",
"保安族",
"俄罗斯族",
"裕固族",
"乌孜别克族",
"门巴族",
"鄂伦春族",
"独龙族",
"塔塔尔族",
"赫哲族",
"珞巴族"
];

// 日期数据
(function(){
     var date = {
          year:[],
          month:[],
          day:[]
     }
     var year = new Date().getFullYear();
     year = parseInt(year);
     for(var i=1950; i<=year;i++){
          date.year.push(i)
     };
     for(var j=1;j<=12;j++){
          if(j<10){
               j = "0"+j;
          }
          date.month.push(j);
     };
     for(var k=1;k<=31;k++){
          if(k<10){
               k = "0"+k;
          }
          date.day.push(k);
     };
     window.date = date;
})();
