var majorArray = [{
        major: "电气信息类",
        submajor: ["电气工程及其自动化",
            "自动化",
            "电子信息工程",
            "通信工程",
            "计算机科学与技术",
            "电子科学与技术",
            "生物医学工程",
            "电子工程与自动化",
            "信息工程",
            "软件工程",
            "影视艺术技术",
            "网络工程",
            "信息显示与光电技术",
            "集成电路设计与集成系统",
            "光电信息工程",
            "广播电视工程",
            "电气信息工程",
            "计算机软件",
            "电子工程与管理",
            "微电子制造工程",
            "假肢矫形工程",
            "数字媒体艺术",
            "医学信息工程",
            "信息物理工程",
            "医疗器械工程",
            "智能科学与技术",
            "数字媒体技术",
            "医学影像工程",
            "真空电子技术",
            "电磁场与无线技术",
            "电信工程及管理",
            "其他"
        ]
    },
    {
        major: "电子信息科学类",
        submajor: [
            "电子信息科学与技术",
            "微电子学",
            "光信息科学与技术",
            "科技防卫",
            "信息安全",
            "信息科学技术",
            "光电子技术科学",
            "其他",
        ]
    },
    {
        major: "仪器仪表类",
        submajor: [
            "测控技术与仪器",
            "其他",
        ]
    },
    {
        major: "工商管理类",
        submajor: ["工商管理",
            "市场营销",
            "会计学",
            "财务管理",
            "人力资源管理",
            "旅游管理",
            "商品学",
            "审计学",
            "电子商务",
            "物流管理",
            "国际商务",
            "物业管理",
            "特许经营管理",
            "连锁经营管理",
            "资产评估",
            "电子商务及法律",
            "其他",
        ]
    },
    {
        major: "管理科学与工程类",
        submajor: [
            "管理科学",
            "信息管理与信息系统",
            "工业工程",
            "工程管理",
            "工程造价",
            "房地产经营管理",
            "产品质量工程",
            "项目管理",
            "管理科学与工程",
            "其他",
        ]
    },
    {
        major: "经济学类",
        submajor: [
            "经济学",
            "国际经济与贸易",
            "财政学",
            "金融学",
            "国民经济管理",
            "贸易经济",
            "保险",
            "金融工程",
            "税务",
            "信用管理",
            "网络经济学",
            "体育经济",
            "投资学",
            "环境资源与发展经济学",
            "海洋经济学",
            "其他",
        ]
    },
    {
        major: "能源动力学",
        submajor: ["热能与动力工程",
            "核工程与核技术",
            "其他",
        ]
    },
    {
        major: "教育学类",
        submajor: ["教育学",
            "学前教育",
            "特殊教育",
            "教育技术学",
            "小学教育",
            "艺术教育",
            "人文教育",
            "科学教育",
            "言语听觉科学",
            "华文教育",
            "医学人文学系",
            "医用理学系",
            "其他",
        ]
    },
    {
        major: "交通运输类",
        submajor: ["交通运输",
            "交通工程",
            "油气储运工程",
            "飞行技术",
            "航海技术",
            "轮机工程",
            "其他"
        ]
    },
    {
        major: "航空航天类",
        submajor: ["飞行器设计与工程",
            "飞行器动力工程",
            "飞行器制造工程",
            "飞行器环境与生命保障工程",
            "其他"
        ]
    },
    {
        major: "机械类",
        submajor: ["机械设计制造及其自动化",
            "材料成型及控制工程",
            "工业设计",
            "过程装备与控制工程",
            "其他",
        ]
    },
    {
        major: "统计学类",
        submajor: [
            "统计学",
            "其他",
        ]
    },
    {
        major: "工程力学类",
        submajor: [
            "工程力学",
            "其他",
        ]
    },
    {
        major: "材料类",
        submajor: [
            "冶金工程",
            "金属材料工程",
            "无机非金属材料工程",
            "高分子材料工程",
            "其他",
        ]
    },
    {
        major: "数学类",
        submajor: [
            "数学与应用数学",
            "信息与计算科学",
            "数理基础科学",
            "其他",
        ]
    },
    {
        major: "物理学类",
        submajor: [
            "物理学",
            "应用物理学",
            "声学",
            "其他",
        ]
    },
    {
        major: "化学类",
        submajor: [
            "化学",
            "应用化学",
            "化学生物学",
            "分子科学与工程",
            "其他",
        ]
    },
    {
        major: "中国语言文学类",
        submajor: [
            "汉语言文学",
            "汉语言",
            "对外汉语",
            "中国少数民族语言文学",
            "古典文献",
            "中国语言文化",
            "应用语言学",
            "其他",
        ]
    },
    {
        major: "外国语言文学类",
        submajor: [
            "英语",
            "俄语",
            "德语",
            "法语",
            "西班牙语",
            "阿拉伯语",
            "日语",
            "波斯语",
            "朝鲜语",
            "菲律宾语",
            "梵语巴利语",
            "印度尼西亚语",
            "印地语",
            "柬埔寨语",
            "老挝语",
            "缅甸语",
            "马来语",
            "蒙古语",
            "僧伽罗语",
            "泰语",
            "乌尔都语",
            "希伯来语",
            "越南语",
            "豪萨语",
            "斯瓦希里语",
            "阿尔巴尼亚语",
            "保加利亚语",
            "波兰语",
            "捷克语",
            "罗马尼亚语",
            "葡萄牙语",
            "瑞典语",
            "土耳其语",
            "希腊语",
            "匈牙利语",
            "意大利语",
            "塞尔维亚-克罗地亚语",
            "其他",
        ]
    },
    {
        major: "地质学类",
        submajor: ["地质学",
            "地球化学",
            "其他",
        ]
    },
    {
        major: "地理科学类",
        submajor: ["地理科学",
            "资源环境与城乡规划管理",
            "地理信息系统",
            "地球信息科学与技术",
            "其他",
        ]
    },
    {
        major: "地球物理学类",
        submajor: ["地球物理学",
            "地球与空间科学",
            "空间科学与技术",
            "其他",
        ]
    },
    {
        major: "大气科学类",
        submajor: ["大气科学",
            "应用气象学",
            "其他",
        ]
    },
    {
        major: "海洋科学类",
        submajor: ["海洋科学",
            "海洋技术",
            "海洋管理",
            "军事海洋学",
            "海洋生物资源与环境",
            "其他",
        ]
    },
    {
        major: "力学类",
        submajor: ["理论与应用力学",
            "其他",
        ]
    },
    {
        major: "新闻传播学类",
        submajor: ["新闻学",
            "广播电视新闻学",
            "广告学",
            "编辑出版学",
            "传播学",
            "媒体创意",
            "其他",
        ]
    },
    {
        major: "材料科学类",
        submajor: ["材料物理",
            "材料化学",
            "其他",
        ]
    },
    {
        major: "环境科学类",
        submajor: ["环境科学",
            "生态学",
            "资源环境科学",
            "其他",
        ]
    },
    {
        major: "心理学类",
        submajor: ["应用心理学",
            "心理学",
            "其他",
        ]
    },
    {
        major: "法学类",
        submajor: ["法学",
            "知识产权",
            "监狱学",
            "其他",
        ]
    },
    {
        major: "地矿类",
        submajor: ["采矿工程",
            "石油工程",
            "矿物加工工程",
            "勘查技术与工程",
            "资源勘查工程",
            "其他",
        ]
    },
    {
        major: "天文学类",
        submajor: ["天文学",
            "其他",
        ]
    },
    {
        major: "艺术类",
        submajor: ["音乐学",
            "作曲与作曲技术理论",
            "音乐表演",
            "绘画",
            "雕塑",
            "美术学",
            "艺术设计学",
            "艺术设计",
            "舞蹈学",
            "舞蹈编导",
            "戏剧学",
            "表演",
            "导演",
            "戏剧影视文学",
            "戏剧影视美术设计",
            "摄影",
            "录音艺术",
            "动画",
            "播音与主持艺术",
            "广播电视编导",
            "艺术学",
            "影视学",
            "广播影视编导",
            "书法学",
            "照明技术",
            "会展艺术与技术",
            "音乐科技与艺术",
            "其他",
        ]
    },
    {
        major: "历史学类",
        submajor: ["历史学",
            "世界历史",
            "考古学",
            "博物馆学",
            "民族学",
            "文物保护技术",
            "其他",
        ]
    },
    {
        major: "哲学类",
        submajor: ["哲学",
            "逻辑学",
            "宗教学",
            "伦理学",
            "其他",
        ]
    },
    {
        major: "土建类",
        submajor: ["建筑学",
            "城市规划",
            "土木工程",
            "建筑环境与设备工程",
            "给水排水工程",
            "其他",
        ]
    },
    {
        major: "水利类",
        submajor: ["水利水电工程",
            "水文与水资源工程",
            "港口航道与海岸工程",
            "其他",
        ]
    },
    {
        major: "测绘类",
        submajor: ["测绘工程",
            "其他",
        ]
    },
    {
        major: "基础医学类",
        submajor: ["组织胚胎学",
            "病理学系",
            "生理学",
            "病理生理学",
            "药理学系",
            "生物化学",
            "细胞与遗传医学系",
            "免疫学系",
            "病原生物学系",
            "神经生物学系",
            "法医学系",
            "生物医学外语",
            "生物物理学系",
            "医学信息学系",
            "解剖学",
            "其他",
        ]
    },
    {
        major: "临床医学",
        submajor: ["耳鼻喉",
            "临床诊断",
            "精神卫生",
            "皮肤病与性病",
            "康复与运动医学",
            "影像医学",
            "麻醉学",
            "全科医学",
            "肿瘤学",
            "中西医结合",
            "眼科",
            "内科",
            "外科",
            "儿科",
            "妇产",
            "口腔医学",
            "其他",
        ]
    },
    {
        major: "中医学类",
        submajor: ["中医学",
            "针灸推拿学",
            "蒙医学",
            "藏医学",
            "中西医临床医学",
            "维医学",
            "其他",
        ]
    },
    {
        major: "法医学类",
        submajor: ["法医学",
            "其他",
        ]
    },
    {
        major: "护理学类",
        submajor: ["内外科护理学",
            "妇科护理学",
            "人文护理学",
            "护理学",
            "其他",
        ]
    },
    {
        major: "武器类",
        submajor: ["武器系统与发射工程",
            "探测制导与控制技术",
            "弹药工程与爆炸技术",
            "特种能源工程与烟火技术",
            "地面武器机动工程",
            "信息对抗技术",
            "其他",
        ]
    },
    {
        major: "生物科学类",
        submajor: ["生物科学",
            "生物技术",
            "生物信息学",
            "生物信息技术",
            "生物科学与生物技术",
            "动植物检疫",
            "生物化学与分子生物学",
            "医学信息学",
            "植物生物技术",
            "动物生物技术",
            "动物资源科学",
            "生物安全",
            "其他",
        ]
    },
    {
        major: "化工与制药类",
        submajor: ["化学工程与工艺",
            "制药工程",
            "其他",
        ]
    },
    {
        major: "生物工程类",
        submajor: ["生物工程",
            "其他",
        ]
    },
    {
        major: "农业工程类",
        submajor: ["农业机械化及其自动化",
            "农业电气化与自动化",
            "农业建筑环境与能源工程",
            "农业水利工程",
            "森林工程",
            "其他",
        ]
    },
    {
        major: "林业工程类",
        submajor: ["木材科学与工程",
            "林产化工",
            "其他",
        ]
    },
    {
        major: "公安技术类",
        submajor: ["刑事科学技术",
            "消防工程",
            "其他",
        ]
    },
    {
        major: "植物生产类",
        submajor: ["农学",
            "园艺",
            "植物保护",
            "茶学",
            "其他",
        ]
    },
    {
        major: "草业科学类",
        submajor: ["草业科学",
            "其他",
        ]
    },
    {
        major: "森林资源类",
        submajor: ["林学",
            "森林资源保护与游憩",
            "野生动物与自然保护区管理",
            "其他",
        ]
    },
    {
        major: "环境生态类",
        submajor: ["园林",
            "水土保护与荒漠化防治",
            "农业资源与环境",
            "其他",
        ]
    },
    {
        major: "动物生产类",
        submajor: [
            "动物科学",
            "蚕学",
            "其他",
        ]
    },
    {
        major: "动物医学类",
        submajor: ["动物医学",
            "其他",
        ]
    },
    {
        major: "水产类",
        submajor: ["水产养殖学",
            "海洋渔业科学与技术",
            "其他",
        ]
    },
    {
        major: "环境与安全类",
        submajor: ["环境工程",
            "安全工程",
            "其他",
        ]
    },
    {
        major: "药学类",
        submajor: ["生物合成药物化学",
            "天然药物化学和生药学",
            "药事管理与临床药学",
            "药剂学",
            "物理化学",
            "放射药学",
            "药物分析",
            "医院药学",
            "分子与细胞药理学",
            "基础药理学",
            "临床药理学",
            "天然药理学",
            "毒理学系",
            "合成药物化学",
            "中药学",
            "制药工程",
            "其他",
        ]
    },
    {
        major: "海洋工程类",
        submajor: ["船舶与海洋工程",
            "其他",
        ]
    },
    {
        major: "轻工纺织食品类",
        submajor: ["食品科学与工程",
            "轻化工程",
            "包装工程",
            "印刷工程",
            "纺织工程",
            "服装设计与工程",
            "其他",
        ]
    },
    {
        major: "农业经济管理类",
        submajor: ["农林经济管理",
            "农村区域发展",
            "其他",
        ]
    },
    {
        major: "公共管理类",
        submajor: ["行政管理",
            "公共事业管理",
            "土地资源管理",
            "劳动与社会保障",
            "公共关系学",
            "公共政策学",
            "城市管理",
            "公共管理",
            "文化产业管理",
            "会展经济与管理",
            "国防教育与管理",
            "航运管理",
            "劳动管理",
            "公共安全管理",
            "其他",
        ]
    },
    {
        major: "公安学类",
        submajor: ["治安学",
            "侦查学",
            "边防管理",
            "火灾勘察",
            "禁毒学",
            "警犬技术",
            "经济犯罪侦查",
            "边防指挥",
            "消防指挥",
            "警卫学",
            "公安情报学",
            "犯罪学",
            "公安管理学",
            "其他",
        ]
    },
    {
        major: "图书档案学类",
        submajor: ["图书馆学",
            "档案学",
            "信息资源管理",
            "其他",
        ]
    },
    {
        major: "生命科学",
        submajor: ["生态与进化生物学系",
            "微生物学与微生物工程系",
            "生理学与生物物理学",
            "遗传学和遗传工程系",
            "生物化学系",
            "生物科学与技术系",
            "生物工程系",
            "生物医学工程系",
            "生物信息学与生物统计学",
            "其他",
        ]
    },
    {
        major: "公共卫生学",
        submajor: ["流行病学",
            "劳动卫生与职业病学",
            "环境卫生学",
            "营养与食品卫生学",
            "少儿卫生学",
            "卫生统计与社会医学",
            "预防医学",
            "卫生微生物学",
            "医院管理学",
            "卫生化学",
            "卫生法与卫生监督学",
            "健康教育学",
            "卫生政策与管理学系",
            "卫生事业管理学",
            "社会医学",
            "卫生经济学",
            "病理学与营养学系",
            "环境医学系",
            "其他",
        ]
    },
    {
        major: "政治学类",
        submajor: ["政治学与行政学",
            "国际政治",
            "外交学",
            "思想政治教育",
            "国际文化交流",
            "国际政治经济学",
            "国际事务",
            "国际事务与国际关系",
            "国际事务与欧洲关系",
            "其他",
        ]
    },
    {
        major: "马克思主义理论类",
        submajor: ["中国革命史与中国共产党党史",
            "科学社会主义与国际共产主义运动",
            "其他",
        ]
    },
    {
        major: "社会学类",
        submajor: ["社会学",
            "社会工作",
            "家政学",
            "人类学",
            "其他",
        ]
    },
    {
        major: "体育学类",
        submajor: ["体育教育",
            "运动训练",
            "社会体育",
            "运动人体科学",
            "民族传统体育",
            "运用康复与健康",
            "其他",
        ]
    }
];

(function() {
    for (var i = 0; i < majorArray.length; i++) {
        majorArray[i].submajor.push("不限");
    };
    var exMajor = {
        major: "不限",
        submajor: ["不限"]
    };
    majorArray.push(exMajor);
})()
window.majorArray = majorArray;

function maxmajorcalculate() {
    var maxmajor = "";
    var maxsubmajor = "";
    for (var i = 0; i < majorArray.length; i++) {
        if (majorArray[i].major.length > maxmajor.length) {
            maxmajor = majorArray[i].major;
        }
        for (var j = 0; j < majorArray[i].submajor.length; j++) {
            if (majorArray[i].submajor[j].length > maxsubmajor.length) {
                maxsubmajor = majorArray[i].submajor[j];
            }
        }
    };
    console.log(maxmajor, maxmajor.length);
    console.log(maxsubmajor, maxsubmajor.length);
}
// maxmajorcalculate();